
# Есть значение радиуса круга
radius = 42

# Площадь круга с точностью до 4 знаков
pi = 3.1415926
area = pi * (radius ** 2)
print(round(area, 4))


# Далее, пусть есть координаты точки
point_1 = (23, 34)
# Расстояние от точки до начала координат
x1 = point_1[0]
y1 = point_1[1]
distance_1 = (x1 ** 2 + y1 ** 2) ** 0.5

# Проверяем, внутри ли круга, и печатаем True/False
print(distance_1 <= radius)

# Аналогично для другой точки
point_2 = (30, 30)
x2 = point_2[0]
y2 = point_2[1]
distance_2 = (x2 ** 2 + y2 ** 2) ** 0.5

print(distance_2 <= radius)
# Пример вывода на консоль:
#
# 77777.7777
# False
# False


