
# Создайте списки:

# моя семья (минимум 3 элемента, есть еще дедушки и бабушки, если что)

my_family = ['папа', 'мама', 'я']

# список списков приблизительного роста членов семьи
my_family_height = [
    ['папа', 185],
    ['мама', 165],
    ['я', 183],
]

# Рост отца
print('Рост отца -', my_family_height[0][1], 'см')
print('Рост мамы -', my_family_height[1][1], 'см')
print('Мой рост -', my_family_height[2][1], 'см')

# Общий рост семьи
total = my_family_height[0][1] + my_family_height[1][1] + my_family_height[2][1]
print('Общий рост моей семьи -', total, 'см')
